app/controllers/courts_controller.rb

SELECT "courts".* FROM "courts" ORDER BY "courts"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "courts".* FROM "courts" INNER JOIN "reservations" ON "reservations"."court_id" = "courts"."id" WHERE (reservations.start_time >= '2022-01-01 12:00:00' and reservations.start_time < '2022-01-01 13:00:00') GROUP BY "courts"."id" HAVING (count(reservations.id)=0)
---
  def index
    @court = Court.all
    debugger
    if params[:date].present? && params[:time].present?
      date = DateTime.parse("#{params[:date]} #{params[:time]}")

      #retrieve the courts which are available for a specific date and time
      @courts = @court.joins(:reservations).where("reservations.start_time >= ? and reservations.start_time < ?", date, date+1.hour).group("courts.id").having("count(reservations.id)=0")